In [1]:
import pandas as pd

In [2]:
df = pd.read_json('FinNum_test_rebuilded.json')

In [3]:
df.head()

,id,idx,target_num,tweet
0,104342607,7344,"[24.23, 10, 6.8]",$EPD Long 24.23. A Barron&#39;s Top 10 pick fo...
1,100758914,2901,[1],$XTNT in this $frta and $amrs was a great day ...
2,102003216,6925,[.100],"$PTX absolutely zero worries here, seriously....."
3,99306434,475,[2],"$OPY Finally a 2 handle, no reason to sell und..."
4,104768477,2364,[3],All 3 performed well tdy &amp; hopeful will co...

In [5]:
#cat = df.set_index(['id', 'idx', 'tweet'])['category'].apply(pd.Series).stack()
#cat = cat.reset_index()
#cat.rename(columns = {0:'category'}, inplace = True)

#sub = df.set_index(['id', 'idx', 'tweet'])['subcategory'].apply(pd.Series).stack()
#sub = sub.reset_index()
#sub.rename(columns = {0:'subcategory'}, inplace = True)

tar = df.set_index(['id', 'idx', 'tweet'])['target_num'].apply(pd.Series).stack()
tar = tar.reset_index()
tar.rename(columns = {0:'target_num'}, inplace = True)

In [ ]:

#print(cat.shape)
#print(sub.shape)
#print(tar.shape)

In [ ]:
#cat.head()

In [6]:
#joined = pd.concat([cat, sub, tar], axis=1, sort=False)
joined = pd.concat([tar], axis=1, sort=False)
joined.head()

,id,idx,tweet,level_3,target_num
0,104342607,7344,$EPD Long 24.23. A Barron&#39;s Top 10 pick fo...,0,24.23
1,104342607,7344,$EPD Long 24.23. A Barron&#39;s Top 10 pick fo...,1,10
2,104342607,7344,$EPD Long 24.23. A Barron&#39;s Top 10 pick fo...,2,6.8
3,100758914,2901,$XTNT in this $frta and $amrs was a great day ...,0,1
4,102003216,6925,"$PTX absolutely zero worries here, seriously.....",0,.100

In [7]:
joined = joined.loc[:,~joined.columns.duplicated()]
joined.head()

,id,idx,tweet,level_3,target_num
0,104342607,7344,$EPD Long 24.23. A Barron&#39;s Top 10 pick fo...,0,24.23
1,104342607,7344,$EPD Long 24.23. A Barron&#39;s Top 10 pick fo...,1,10
2,104342607,7344,$EPD Long 24.23. A Barron&#39;s Top 10 pick fo...,2,6.8
3,100758914,2901,$XTNT in this $frta and $amrs was a great day ...,0,1
4,102003216,6925,"$PTX absolutely zero worries here, seriously.....",0,.100

In [8]:
joined.drop('level_3', axis = 1, inplace = True)

In [9]:
joined.to_csv('test.csv', index = False)

In [10]:
test = pd.read_csv('test.csv')
test.head()

,id,idx,tweet,target_num
0,104342607,7344,$EPD Long 24.23. A Barron&#39;s Top 10 pick fo...,24.23
1,104342607,7344,$EPD Long 24.23. A Barron&#39;s Top 10 pick fo...,10
2,104342607,7344,$EPD Long 24.23. A Barron&#39;s Top 10 pick fo...,6.8
3,100758914,2901,$XTNT in this $frta and $amrs was a great day ...,1
4,102003216,6925,"$PTX absolutely zero worries here, seriously.....",.100